# Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
# Найдите количество и выведите его.

# Пример:

# list_1 = [1, 2, 3, 4, 5]
# k = 3
# 1


from random import randint
n = int(input('Введите длину списка: '))
k = int(input('Введите число: '))

list1 = [randint(-5, 5) for _ in range(n)]





# len = []

# for i in len:
#     print(i)



# # print(lst := [for _ in range(1, 11)])


# print(len(set(lst)))



# list_1 = [1, 2, 3, 5] # заполненный список
# print(list_1)

# list_1 = [1, 2, 3, 5] # заполненный список
# print(*list_1)        # вывод списка только из цифр
# print(len(list_1))    # Размер списка
# print(list_1[2])      # Указывает цифру в списке по номеру индекса
# print(list_1[-1])     # Указывает цифру в списке по номеру индекса

